ADDED: readme.md, fix one comment,  cidr fix in string
